In [8]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [109]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from sklearn.linear_mode import LogisticRegression


#read in data with pd.read_csv('filename/path')
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
test

ModuleNotFoundError: No module named 'sklearn.linear_mode'

In [89]:
# grab a column with the format df['columnName']

In [90]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [91]:
cleaned_train = train[['Pclass', 'Sex', 'Age']].copy()
cleaned_train

     Pclass     Sex   Age
0         3    male  22.0
1         1  female  38.0
2         3  female  26.0
3         1  female  35.0
4         3    male  35.0
..      ...     ...   ...
886       2    male  27.0
887       1  female  19.0
888       3  female   NaN
889       1    male  26.0
890       3    male  32.0

[891 rows x 3 columns]

In [92]:
mean_age = train['Age'].mean()
mean_age

29.69911764705882

In [93]:
cleaned_train

     Pclass     Sex   Age
0         3    male  22.0
1         1  female  38.0
2         3  female  26.0
3         1  female  35.0
4         3    male  35.0
..      ...     ...   ...
886       2    male  27.0
887       1  female  19.0
888       3  female   NaN
889       1    male  26.0
890       3    male  32.0

[891 rows x 3 columns]

In [94]:
new_age_col = cleaned_train['Age'].fillna(mean_age)
cleaned_train['Age'] = new_age_col
cleaned_train

     Pclass     Sex        Age
0         3    male  22.000000
1         1  female  38.000000
2         3  female  26.000000
3         1  female  35.000000
4         3    male  35.000000
..      ...     ...        ...
886       2    male  27.000000
887       1  female  19.000000
888       3  female  29.699118
889       1    male  26.000000
890       3    male  32.000000

[891 rows x 3 columns]

In [95]:
cleaned_train['Sex'] = (cleaned_train['Sex']=='female').astype(int)
cleaned_train

     Pclass  Sex        Age
0         3    0  22.000000
1         1    1  38.000000
2         3    1  26.000000
3         1    1  35.000000
4         3    0  35.000000
..      ...  ...        ...
886       2    0  27.000000
887       1    1  19.000000
888       3    1  29.699118
889       1    0  26.000000
890       3    0  32.000000

[891 rows x 3 columns]

In [97]:
X_matrix = cleaned_train.values
y = train['Survived']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [128]:
mod = LogisticRegression()
mod.fit(X_matrix, y)

NameError: name 'LogisticRegression' is not defined

In [123]:
clean_test = test[['Pclass', 'Sex', 'Age']].copy()
clean_test['Age'] = clean_test['Age'].fillna(mean_age)

In [124]:
clean_test['Sex'] = (clean_test['Sex']=='female').astype(int)

In [125]:
x_test = clean_test.values

In [127]:
pred = (mod.predict(x_test))
test['Survived'] = pred
final_submission = test[['Pclass', 'Sex', 'Age']]

final_submission.reset_index(drop = True).to_csv('titanic_test.csv',  index= False)

NameError: name 'mod' is not defined